{
  "hello": "Hello! How can I help you today?",
  "hi": "Hi there! How are you doing?",
  "hey": "Hey! How's your day going?",
  "how are you": "I'm doing great, thanks for asking! How about you?",
  "good morning": "Good morning! Hope you have a productive day ahead.",
  "good afternoon": "Good afternoon! How can I assist you?",
  "good evening": "Good evening! How may I help you?",
  "what's up": "Not much, just here to help you with your CRM questions!",
  "who are you": "I'm your CRM assistant bot.",

  "pricing": "Our pricing depends on your chosen plan. Please check the Pricing section in the CRM.",
  "plans": "We offer multiple plans depending on business size. Would you like to know about Basic, Pro, or Enterprise?",
  "subscription cost": "Our subscription starts at $29/month for Basic, $99/month for Pro, and $299/month for Enterprise.",
  "cost": "Our subscription starts at $29/month for Basic, $99/month for Pro, and $299/month for Enterprise.",
  "free trial": "Yes, we offer a 14-day free trial for new users. No credit card required.",
  "discount": "We provide seasonal discounts and annual subscription offers. Please contact sales for details.",
  "upgrade plan": "You can upgrade your plan anytime from the Billing section of your CRM account.",
  "downgrade plan": "Yes, you can downgrade your plan at any time from the Billing settings.",

  "support": "Yes, all plans include customer support. Pro and Enterprise get 24/7 priority support.",
  "customer care": "Our support team is available via live chat, email, and phone.",
  "technical support": "Please raise a support ticket under 'Help' in your dashboard.",
  "help": "Our support team is here to assist you via chat, email, and phone.",
  "contact support": "You can contact support directly from your dashboard → Help Center.",

  "leads": "You can add or view leads in the CRM Leads page.",
  "add lead": "To add a lead, go to Leads → Add New.",
  "import leads": "You can bulk import leads using a CSV file in the Leads section.",
  "lead status": "Lead statuses include New, In Progress, Won, and Lost.",
  "track leads": "Check the Leads dashboard for tracking.",
  "edit lead": "To edit a lead, open the lead record and click on 'Edit'.",
  "delete lead": "You can delete leads by selecting them and clicking the delete option.",

  "contacts": "Your contacts can be managed under the Contacts page.",
  "add contact": "To add a contact, go to Contacts → Add New.",
  "merge contacts": "You can merge duplicate contacts by selecting them and clicking 'Merge'.",
  "delete contact": "Contacts can be deleted by selecting them and choosing 'Delete'.",

  "opportunities": "Opportunities help track potential deals with clients.",
  "create opportunity": "Go to Opportunities → Add New to create one.",
  "opportunity status": "Statuses include Open, Negotiation, Won, Lost.",
  "close deal": "To close a deal, update the opportunity status to Won or Lost.",

  "dashboard": "The dashboard gives you an overview of leads, deals, and activities.",
  "customize dashboard": "Click the 'Customize' button on the dashboard to add/remove widgets.",
  "reports": "Reports are available in the Reports section. You can generate sales, leads, and activity reports.",
  "download report": "Yes, reports can be downloaded in PDF or Excel format.",
  "schedule report": "You can schedule reports to be sent via email automatically.",

  "integrations": "We integrate with Gmail, Outlook, Slack, Zapier, and other popular tools.",
  "connect email": "You can connect your email in Settings → Integrations.",
  "calendar sync": "Yes, you can sync Google Calendar or Outlook calendar from integrations.",
  "third-party apps": "We support integrations with Google Workspace, Microsoft Teams, and more.",

  "tasks": "Tasks help you stay on top of daily activities.",
  "add task": "Go to Tasks → Add New to assign a task.",
  "assign task": "You can assign tasks to team members by selecting them from the dropdown.",
  "task reminder": "You can set reminders and due dates for tasks.",
  "delete task": "Tasks can be deleted from the task list by selecting 'Delete'.",

  "notifications": "Notifications alert you about lead updates, tasks, and meetings.",
  "turn off notifications": "You can disable or customize notifications from Settings.",
  "mute alerts": "Yes, you can mute specific notifications in the settings.",

  "account settings": "You can update your details from Account Settings.",
  "change password": "Go to Settings → Security → Change Password.",
  "reset password": "Click 'Forgot Password' on the login page to reset it.",
  "delete account": "Please contact support to delete your account permanently.",
  "profile": "You can update your profile picture and details under Account Settings.",

  "billing": "Billing information can be managed in the Billing section.",
  "payment methods": "We accept credit cards, debit cards, PayPal, and bank transfers.",
  "invoice": "You can download invoices from the Billing → Invoices page.",
  "refund policy": "Refunds are processed if requested within 14 days of payment.",
  "auto-renew": "Yes, subscriptions renew automatically unless canceled.",

  "security": "We use industry-standard encryption to protect your data.",
  "2fa": "Yes, two-factor authentication is available under Security Settings.",
  "data backup": "Your data is backed up daily to ensure safety.",
  "gdpr": "Yes, we are GDPR compliant to ensure data privacy.",

  "api": "We provide REST API for developers.",
  "api key": "You can generate an API key under Developer Settings.",
  "webhooks": "Yes, webhooks are supported for lead updates and task creation.",
  "api docs": "Our API documentation is available in the Developer Portal.",

  "mobile app": "Yes, we have mobile apps for both iOS and Android.",
  "download app": "You can download the app from the App Store or Google Play.",
  "app features": "The mobile app supports lead management, tasks, and notifications on the go.",

  "team": "You can manage your team in the Team section.",
  "add user": "Go to Team → Add User to invite members.",
  "user roles": "We support roles like Admin, Manager, and Agent.",
  "permissions": "Admins can set permissions for different users.",

  "activity log": "The activity log tracks all user actions in the CRM.",
  "audit log": "Admins can access detailed audit logs for compliance.",

  "training": "We provide training videos and documentation in the Help Center.",
  "documentation": "Official docs are available at the support portal.",
  "webinar": "You can join our free product webinars every month.",
  "demo": "We provide live product demos upon request.",

  "language": "The CRM is available in English, Spanish, French, and German.",
  "timezone": "You can change your timezone from Account Settings.",
  "logout": "To log out, click on your profile icon and select Logout.",

  "bye": "Goodbye! Have a nice day.",
  "thanks": "You are welcome! Happy to help.",
  "thank you": "Glad I could help!",
  "goodbye": "Take care! See you soon.",

  "change language": "You can change your preferred language from Account Settings -> Language Preferences.",
  "switch timezone": "Yes, you can update your timezone from Account Settings -> Timezone. All timestamps will update automatically.",
  "deactivate account": "You can temporarily deactivate your account under Account Settings -> Security -> Deactivate Account. You can reactivate anytime by logging back in.",
  "cryptocurrency payments": "Currently, we do not support direct cryptocurrency payments. Please use supported methods like credit card, PayPal, or bank transfer.",
  "invoice last month": "Yes, you can download invoices from Billing -> Invoices. Select the month you want and click 'Download PDF'.",
  "merge duplicate contacts": "Go to Contacts -> Tools -> Merge Duplicates. The system will suggest possible duplicates, and you can confirm merges automatically.",
  "set recurring tasks": "When creating a new task, select the Recurrence option and choose how often you want it to repeat (daily, weekly, monthly, etc.).",
  "mark multiple opportunities won": "Go to Opportunities -> List View, select the opportunities you want, and use the bulk action menu to mark them as Won.",
  "setup webhook tasks": "Navigate to Settings -> Integrations -> Webhooks. Add a new webhook, select 'Tasks' as the event type, and provide your webhook URL.",
  "enable two-factor authentication": "Enable 2FA from Account Settings -> Security -> Two-Factor Authentication. You'll need an authenticator app (like Google Authenticator or Authy).",
  "download crm backup": "Admins can download a full backup by going to Settings -> Data Management -> Export Data. You can choose CSV, Excel, or JSON format.",
  "offline mode mobile app": "Currently, offline mode is not supported. You'll need an internet connection to use the mobile app.",
  "dark mode dashboard": "Yes, dark mode can be enabled under User Settings -> Appearance -> Dark Mode.",
  "reset dashboard settings": "Go to Dashboard Settings -> Reset to Default. This will remove all custom widgets and layouts.",

  "What does CRM mean?": "CRM stands for Customer Relationship Management. It is a system that helps businesses manage customer data, interactions, and relationships effectively.",
  "What are the main features of a CRM?": "Common features include contact management, lead tracking, sales pipeline management, task automation, reporting, and integrations with other tools.",
  "What are the benefits of using a CRM?": "A CRM improves customer relationships, boosts sales, saves time with automation, and centralizes all customer information in one place.",
  "Is CRM useful for small businesses?": "Yes. Small businesses can use CRM to organize leads, track sales, and improve customer engagement without needing complex systems.",
  "How is CRM better than Excel?": "Unlike Excel, a CRM offers automation, real-time collaboration, analytics, and integrations that make managing customers easier and more scalable.",
  "Why is CRM important?": "CRM is important because it keeps all customer data organized, helps track sales opportunities, and provides insights for business growth.",
  "Can you give examples of CRM software?": "Yes. Popular CRM software includes Salesforce, HubSpot, Zoho CRM, and Pipedrive.",
  "What is CRM automation?": "CRM automation refers to automating tasks like sending follow-up emails, assigning leads, creating reminders, and updating records.",
  "What is CRM analytics?": "CRM analytics provide insights into sales performance, customer behavior, and pipeline health using reports and dashboards.",
  "What is CRM integration?": "CRM integration allows you to connect with tools like Gmail, Outlook, Slack, marketing platforms, and Zapier to streamline workflows.",

  "How do I create a new sales pipeline?": "Go to Settings -> Pipelines -> Create New Pipeline. Add stages and name them according to your sales process.",
  "Can I set role-based access for my team?": "Yes. Navigate to Settings -> Users & Roles. Assign roles and permissions to control access levels for each user.",
  "How do I track email opens and clicks?": "Enable email tracking under Settings -> Email Preferences. Once enabled, you can view opens and clicks in the Email Activity log.",
  "Can I schedule automatic follow-up emails?": "Yes. Go to Automation -> Workflows -> Create New Workflow. Set a trigger and choose 'Send Email' as the action.",
  "How do I view my team's performance reports?": "Navigate to Reports -> Team Performance. You can view metrics such as deals closed, revenue generated, and tasks completed.",
  "Can I integrate WhatsApp with the CRM?": "Yes. Go to Settings -> Integrations -> WhatsApp. Connect your WhatsApp Business account to start sending and receiving messages.",
  "How do I set up lead scoring rules?": "Go to Settings -> Lead Scoring. Define rules based on contact behavior, activity, or demographics to assign scores automatically.",
  "Can I bulk update multiple contacts at once?": "Yes. Go to Contacts -> Select Multiple -> Bulk Actions. Choose 'Update' and edit the required fields for all selected contacts.",
  "How do I archive old deals?": "Open the deal and select 'Archive' from the options menu. Archived deals are stored in the Archived tab and can be restored anytime.",
  "Can I create custom dashboards for my team?": "Yes. Go to Dashboard -> Create New Dashboard. Add widgets and reports to customize the view for your team.",
  "How do I set targets or quotas for sales reps?": "Navigate to Settings -> Goals & Quotas. Assign targets to each sales rep and track progress in the reports section.",
  "Can I assign leads automatically based on location?": "Yes. Set up lead assignment rules under Settings -> Automation -> Lead Assignment. Add conditions like location to auto-assign leads.",
  "How do I track customer support tickets?": "Go to Support -> Tickets. You can view, assign, and update the status of all customer support requests.",
  "Can I sync my calendar with the CRM?": "Yes. Navigate to Settings -> Integrations -> Calendar and connect your Google or Outlook calendar for two-way sync.",
  "How do I set up email templates?": "Go to Settings > Email Templates -> Create New. Design your template and save it for future use in campaigns or tasks.",
  "Can I track revenue by region or product?": "Yes. Go to Reports -> Revenue Analytics and filter results by region, product, or sales rep.",
  "How do I create a custom report?": "Navigate to Reports -> Custom Reports -> Create New. Select data sources, filters, and fields to generate your own report.",
  "Can I restrict users from deleting records?": "Yes. Go to Settings -> Roles & Permissions. Edit the role and disable the 'Delete' permission for records.",
  "How do I enable single sign-on (SSO)?": "Go to Settings > Security -> Single Sign-On. Follow the steps to connect your identity provider and enable SSO for your team.",
  "Can I integrate with QuickBooks or other accounting tools?": "Yes. Navigate to Settings -> Integrations -> Accounting. Connect QuickBooks or other supported accounting tools to sync financial data.",

  "How do I merge duplicate contacts?": "Go to Contacts -> Find Duplicates. Select the records you want to merge and choose the primary record to keep.",
  "Can I set automatic lead assignment by industry?": "Yes. Go to Settings -> Automation -> Lead Assignment Rules and configure rules based on industry or other fields.",
  "How do I log phone calls in the CRM?": "Open a contact or deal, click 'Log Activity', and select 'Call'. Enter call details and save.",
  "Can I record call notes or transcripts?": "Yes. After logging a call, you can add notes manually or upload call transcripts if available.",
  "How do I set business hours for support tickets?": "Navigate to Settings -> Support -> Business Hours and define working hours and holidays.",
  "Can I receive mobile push notifications?": "Yes. Install the CRM mobile app and enable push notifications in Settings -> Notifications.",
  "How do I create recurring tasks?": "When creating a task, enable the 'Repeat' option and set the frequency (daily, weekly, monthly, etc.).",
  "Can I track customer lifecycle stages?": "Yes. Go to Settings -> Lifecycle Stages and define stages like Lead, Prospect, Customer, and Lost.",
  "How do I add tags to contacts or deals?": "Open a contact or deal and use the 'Tags' field to add or create new tags.",
  "Can I restrict access to sensitive fields?": "Yes. Go to Settings -> Roles & Permissions and set field-level security for specific user roles.",
  "How do I set up two-factor authentication (2FA)?": "Go to Settings -> Security -> Two-Factor Authentication and enable it. You can use SMS or authenticator apps.",
  "Can I clone a deal or contact record?": "Yes. Open the record and click 'Clone' to duplicate the details into a new entry.",
  "How do I add my company logo to email templates?": "Go to Settings -> Email Templates. Edit a template and use the 'Insert Image' option to upload your logo.",
  "Can I run A/B tests on email campaigns?": "Yes. In Campaigns -> Create Email, choose 'A/B Test' and configure variations to test subject lines or content.",
  "How do I integrate LinkedIn with the CRM?": "Go to Settings -> Integrations -> LinkedIn. Sign in and authorize access to sync leads and messages.",
  "Can I automate deal stage updates?": "Yes. Go to Settings -> Automation -> Workflow Rules and create rules to move deals between stages automatically.",
  "How do I create a shared team inbox?": "Navigate to Settings -> Communication -> Team Inbox and connect your shared email address.",
  "Can I set priority levels for tasks or tickets?": "Yes. While creating or editing a task/ticket, choose a priority level such as Low, Medium, or High.",
  "How do I get notified when a new lead is added?": "Enable lead notifications under Settings -> Notifications or create an automation rule for alerts.",
  "Can I schedule reports to be sent by email?": "Yes. Go to Reports -> Schedule Report, choose the frequency, and add recipients."

}